<?php
// PHP Class-3 

// Learning from Youtube Channel: Projukti Plus

// Channel Link:
//  https://www.youtube.com/@projuktiplus

// Video link for this file named "003.php"
//  https://youtu.be/omfi6vAj9Fk?si=R91bDzOrUa5YGiSF


//***********************************************************
//              003-1. String Concatenation
//***********************************************************
// ***  Concatenation অর্থ হল যোগ করা 
// ***  String Concatenation অর্থ হল পাশাপাশি এক বা একাধিক স্ট্রিং কে যোগ করা
// ***  স্ট্রিং সাধারনত " " এর মধ্যে লেখা হয়
// ***  দুটি স্ট্রিং পাশাপাশি লেখার জন্য বা 
// ***  যোগ করার জন্য বা 
// ***  কনকেটেনেট করার জন্য স্ট্রিং ২টির মাঝে ডট . চিহ্ন দিতে হয়
/*
$price=500;
$product_name="Money Bag";
$string="Product Name: " . $product_name . ". Product Price: " . $price . " BDT.";
echo $string;
*/
// ভ্যারিয়েবল লেখার সময় সেটা " " এর মধ্যে লেখার দরকার নাই
// উপরের কোডের সবগুলা " " এর মধ্যে চেঞ্জ করে করে প্রাক্টিস করতে হবে

//***********************************************************
//              003-2. Space Sheap Operator
//***********************************************************
// স্পেসশিপ অপারেটর এভাবে লেখা হয়ঃ < = >
// এই অপারেটর এর ডানের এবং বামের সং খ্যার মানের তুলনা করে সে অনুযায়ী আউটপুট দেয়
// এই চিহ্নের ডানে এবং বামের সংখ্যার মানের উপর ভিত্তি করে এটা 1 বা 0 বা -1 আউটপুট দেয়
/*
echo 3<=>5; echo "\n"; // বাম পাশে ছোট এবং ডান পাশে বড় হলে -1 আউটপুট দেয়
echo 5<=>3; echo "\n"; // বাম পাশে বড় এবং ডান পাশে ছোট হলে 1 আউটপুট দেয়
echo 3<=>3; echo "\n"; // বাম পাশে এবং ডান পাশে সমান হলে 0 আউটপুট দেয়
*/

//***********************************************************
//              003-3. NULL Coalescing  Operator
//***********************************************************
// ***  NULL Coalescing অপারেটর এভাবে লেখা হয়ঃ ??
// ***  এই চিহ্নের এক পাশে সাধারনত ডিফল্ট ভ্যালু থাকে 
// ***  অন্য পাশে NULL থাকলে এই অপারেটর ঐ ডিফল্ট ভ্যালু ই আউটপুট দেয়
// ***  অন্য পাশে NULL বাদে অন্য কিছু থাকলে ঐ "অন্য কিছু" ই আউটপুট হিসাবে দেয় 
// ***  বিভিন্ন সাইটে পেমেন্টের ক্ষেত্রে কুপন-কোড এর ক্ষেত্রে এই অপারেটর ব্যবহার হয়
/*
$null_value = NULL;
$result1 = $null_value ?? "Visitor"; echo "\n";
echo $result1;

$result2 = "Visitor" ?? $null_value; echo "\n";
echo $result1;

$customer = "Abdur Razzak";
$result3 = $customer ?? "Visitor"; echo "\n";
echo $result3;
*/

//***********************************************************
//              003-4. IF-Else Condition
//***********************************************************


//***********************************************************
//              003-5. Trynari Operator
//***********************************************************



//***********************************************************
//              003-6. IF-Else-IF-Else Condition
//***********************************************************



//***********************************************************
//              003-7. Switch Condition
//***********************************************************
?>